---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DecalLockProportions
source: html/295ee2b6-9f4d-0cb6-a5ec-41fc8158413e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DecalLockProportions Property

"Lock Proportions"

## Syntax (C#)
```csharp
public static ForgeTypeId DecalLockProportions { get; }
```